In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\sajjad sindhi\appdata\local\anaconda3\lib\site-packages (1.5.3)
Requirement already satisfied: pytz>=2020.1 in c:\users\sajjad sindhi\appdata\local\anaconda3\lib\site-packages (from pandas) (2022.7)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\sajjad sindhi\appdata\local\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.21.0 in c:\users\sajjad sindhi\appdata\local\anaconda3\lib\site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in c:\users\sajjad sindhi\appdata\local\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [1]:
import pandas as pd


var = pd.Series([1,2,3,4,5,6])

var

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [2]:
var = pd.DataFrame([[1,2,3,4,5,6,7]])

var

   0  1  2  3  4  5  6
0  1  2  3  4  5  6  7

In [3]:
import pandas

mydataset = {
  'cars': ["BMW", "Volvo", "Ford"],
  'passings': [3, 7, 2]
}

myvar = pandas.DataFrame(mydataset)

print(myvar)

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

In [4]:
import pandas as pd

a = [1, 7, 2]

myvar = pd.Series(a, index = ["x", "y", "z"])

print(myvar)

x    1
y    7
z    2
dtype: int64

In [5]:
import numpy as np

data = np.random.randint(1,100,size=(5,4))

data = pd.DataFrame(data)

data

    0   1   2   3
0  10  80  69  76
1  16  33  63  81
2   1  18  46  67
3   5  91  77   2
4  22  71  83  89

In [6]:
rows_index = [['sindh','sindh','punjab','punjab'],
             ['karachi','hyderabad','lahore','faisalabad']
             ]

data = (200,300,150,175)

df = pd.DataFrame(data,columns=['Not of Students'],index=rows_index)

df

                   Not of Students
sindh  karachi                 200
       hyderabad               300
punjab lahore                  150
       faisalabad              175

In [7]:
def name_generator(max_len):
    r = np.random.randint(3,max_len,1)[0]
    fc = chr(np.random.randint(65,90,1)[0])
    remaing_letters = np.random.randint(97,122,r)
    remaing_letters = list(map(chr, remaing_letters))
    return fc+"".join(remaing_letters)

print(name_generator(5))

list(map(name_generator,np.random.randint(4,20,3)))

Ybra

['Lclhsihttmloajt', 'Myrutpajkvnuuxpguv', 'Lmqqj']

In [8]:
def dob_generator(start, end):
    year = np.random.randint(start,end,1)[0]
    month = np.random.randint(1,12,1)[0]
    day = np.random.randint(1,28,1)[0]
    
    
    return pd.to_datetime(f'{year}/{month}/{day}')

dob_generator(1970,2017)

Timestamp('2009-07-04 00:00:00')

In [9]:
import pandas as pd
import numpy as np
samples = 10000

df = pd.DataFrame({
    "roll_no":np.arange(1, samples+1),
    "Name": list(map(name_generator,np.random.randint(4,20,samples))),
    "Father Name": list(map(name_generator,np.random.randint(4,20,samples))),
    "Course": np.random.choice(["AI","Web","Chatbot","Graphic","Video"], samples),
     "Fee": np.random.choice([1000,1500,2000], samples),
    "dob": [dob_generator(1969,i) for i in np.random.randint(1970,2017,samples)]
})

df1 = pd.DataFrame(np.random.randint(1,100,size=(samples,5)),
                  columns=["s1",'s2','s3','s4','s5'])
df1



df = pd.concat([df,df1], axis=1)

df

,roll_no,Name,Father Name,Course,Fee,dob,s1,s2,s3,s4,s5
0,1,Lflnq,Yper,Web,2000,1983-09-14,96,80,83,70,77
1,2,Mrmqhtxj,Pqwkxklwowgv,Graphic,1500,1969-07-26,84,59,62,19,50
2,3,Pqinmhtbx,Wjuochnrkmhbabagg,Web,1000,1996-09-16,31,96,99,37,9
3,4,Ytmh,Ttsxsjceilgh,Web,1500,1975-09-08,51,99,17,30,59
4,5,Sthdosaiyxng,Bgbfsknkdwluik,Graphic,1000,1985-08-27,27,84,32,17,5
...,...,...,...,...,...,...,...,...,...,...,...
9995,9996,Nvgarhlp,Qxngfe,AI,1000,1972-05-19,73,95,51,24,12
9996,9997,Gykyg,Kkxmqblem,AI,1000,1972-08-03,87,65,22,95,6
9997,9998,Ulveagsloxbrf,Kfad,AI,1500,1980-04-14,87,80,59,33,61
9998,9999,Igke,Wdgmb,Video,2000,1980-04-18,91,57,60,27,37
9999,10000,Nrixb,Qxuj,Web,1000,1970-06-11,37,53,45,49,93

In [10]:
data = pd.DataFrame(np.random.randint(1,1000,size=(1000,5)),columns=['s1','s2','s3','s4','s5'])

data

      s1   s2   s3   s4   s5
0    636  636   22  897  651
1    702  955  430  824  468
2    811  257  399  472  672
3     55  233  173  396  218
4    114   68  236  385  950
..   ...  ...  ...  ...  ...
995  826  462  300  882  467
996   31  117  729  822  454
997  926  823  537   91  190
998  427  109  941  149  854
999   83  769  719  704   81

[1000 rows x 5 columns]

In [11]:
df = df[(df.Course.str.lower().isin(['ai','video']))]
print(len(df))

3986

In [34]:
# Create a 2D NumPy array
data = np.array([])

# Create column names
column_names = ['Heading', 'Heading ', 'Heading ']

# Create a DataFrame with the 2D array and column names
df = pd.DataFrame(data, columns=column_names)

# Print the DataFrame
df

   Heading  Heading   Heading
0        1         2         3
1        4         5         6
2        7         8         9

In [45]:
data = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
column_names = ['CNIC','Name','Heading']
var = pd.DataFrame(data, columns=column_names)
var

   CNIC  Name  Heading
0     1     2        3
1     4     5        6
2     7     8        9

In [12]:
df = df[(df.Course.str.lower().str.contains('ai'))]
print(len(df))

2004